<a href="https://colab.research.google.com/github/lsraei20/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [22]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-06-06 04:54:11--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.24.230
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.24.230|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  62.5MB/s    in 3.3s

2020-06-06 04:54:15 (59.5 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [23]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [24]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [25]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####
#I need the product_name column located at the products.csv dataframe to locate the products
#I will need to concat order_products__prior, order_products__train as well too identify the amount of times a products was ordered
import pandas as pd

In [27]:
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__prior = order_products__prior.drop('order_id', axis=1)
order_products__prior['total orders'] = order_products__prior['add_to_cart_order'] + order_products__prior['reordered']
print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   product_id  add_to_cart_order  reordered  total orders
0       33120                  1          1             2
1       28985                  2          1             3
2        9327                  3          0             3
3       45918                  4          1             5
4       30035                  5          0             5

In [28]:
order_products__train = pd.read_csv('order_products__train.csv')
order_products__train = order_products__train.drop('order_id', axis=1)
order_products__train['total orders'] = order_products__train['add_to_cart_order'] + order_products__train['reordered']
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   product_id  add_to_cart_order  reordered  total orders
0       49302                  1          1             2
1       11109                  2          1             3
2       10246                  3          0             3
3       49683                  4          0             4
4       43633                  5          1             6

In [29]:
#combining and reducing add_to_cart_order and reordered dataframes
order_products = pd.concat([order_products__prior, order_products__train])
order_products = order_products.drop(['add_to_cart_order', 'reordered'], axis=1)
print(order_products.shape)
order_products.head()

(33819106, 2)

   product_id  total orders
0       33120             2
1       28985             3
2        9327             3
3       45918             5
4       30035             5

In [30]:

products = pd.read_csv('products.csv')
print(products.shape)
products =  products.drop(['aisle_id', 'department_id'], axis=1)

(49688, 4)

In [31]:
#Function to get top 10 most common ordered items and their product_id

def get_mode(orders, products, number_of_loops):
  df = orders
  dfnew = pd.DataFrame()
  dftemp = pd.DataFrame()
  for number in range(number_of_loops):
    dftemp = products[products['product_id'] == (df['product_id'].mode().item())]
    df = df[df['product_id'] != (df['product_id'].mode().item())]
    dfnew = pd.concat([dfnew, dftemp])
  return dfnew
global top_ten
top_ten = get_mode(order_products, products, 10)
top_ten

       product_id            product_name
24851       24852                  Banana
13175       13176  Bag of Organic Bananas
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
47208       47209    Organic Hass Avocado
47765       47766         Organic Avocado
47625       47626             Large Lemon
16796       16797            Strawberries
26208       26209                   Limes
27844       27845      Organic Whole Milk

In [32]:
#merge to find total orders
semi_final = pd.merge(top_ten, order_products)
semi_final

         product_id        product_name  total orders
0             24852              Banana             2
1             24852              Banana             6
2             24852              Banana             4
3             24852              Banana             3
4             24852              Banana             3
...             ...                 ...           ...
2418309       27845  Organic Whole Milk            18
2418310       27845  Organic Whole Milk             4
2418311       27845  Organic Whole Milk            11
2418312       27845  Organic Whole Milk            13
2418313       27845  Organic Whole Milk             7

[2418314 rows x 3 columns]

In [33]:
#def to sum everythin up. Table shows products an # of total orders

def finaldef(dfo):
  df = dfo
  final = pd.DataFrame()
  for product in top_ten['product_name']:
    temp = df[df['product_name'] == product]
    temp = pd.DataFrame({'Product_Name': [product], 'Total_Orders': temp['total orders'].sum().item()})
    final = pd.concat([final, temp])
  return final.reset_index(drop=True)

Final_df = finaldef(semi_final)
Final_df

             Product_Name  Total_Orders
0                  Banana       2820830
1  Bag of Organic Bananas       2336671
2    Organic Strawberries       2220447
3    Organic Baby Spinach       2065562
4    Organic Hass Avocado       1674060
5         Organic Avocado       1327324
6             Large Lemon       1391185
7            Strawberries       1170165
8                   Limes       1361018
9      Organic Whole Milk        896250

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [34]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
# table2 -> tidy
table2 = table2.reset_index()

In [68]:
tidy = table2.melt(id_vars= 'index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy = tidy.rename(columns={'index': 'name', 'variable': 'trt', 'value': 'result'})
temp = pd.DataFrame.copy(tidy)
tidy['name']=tidy['trt']
tidy['trt']=temp['name']
tidy.trt = tidy.trt.str.replace('treatment',  '')
tidy

           name trt  result
0    John Smith   a     NaN
1    John Smith   b     2.0
2      Jane Doe   a    16.0
3      Jane Doe   b    11.0
4  Mary Johnson   a     3.0
5  Mary Johnson   b     1.0

In [37]:
# tidy -> table2
wide = tidy.pivot_table(index='trt', columns='name', values='result')
wide

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

In [38]:
flights = sns.load_dataset('flights')

NameError: ignored

In [0]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####